In [1]:
import pandas as pd

In [3]:
df = pd.read_excel("./Dataset/stock_data.xlsx")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [10]:
def convert_people_cell(cell):
    if cell == "n.a.":
        return "sam waltom"
    elif cell == "not available":
        return None
    else:
        return cell

In [11]:
df = pd.read_excel("./Dataset/stock_data.xlsx", converters = {
    "people":convert_people_cell,
    "eps":convert_people_cell
})

In [12]:
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     sam waltom
2    MSFT  -1.00       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

## Save excel file

In [14]:
new_excel = df.to_excel("new.xlsx", index = False)

## Add two excel file

In [15]:
df_stock = pd.DataFrame({
    "tickers": ["GOOGLE", "WMT", "MSFT"],
    "price": [845,67,87],
    "pe": [30.55,45.55,90.09],
    "eps":[34.45,33.44,55.66]
})

In [17]:
df_weather = pd.DataFrame({
    "day":["1/1/2019","1/1/2020","none"],
    "temperature":[22,44,56],
    "event":["Rain","Sunny","Snow"]
})

In [18]:
with pd.ExcelWriter("Stocks_weather.xlsx")as writer:
    df_stock.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")